Notes/Mathematics/Foundation/note.tex
% Created 2019-05-27 Mon 23:50
% Intended LaTeX compiler: xelatex
\documentclass[11pt, a4paper]{article}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{fontspec}
\setmainfont{EB Garamond}
\author{Ahmed Khaled}
\date{\today}
\title{Mathematical Foundation}
\hypersetup{
 pdfauthor={Ahmed Khaled},
 pdftitle={Mathematical Foundation},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.0.50 (Org mode 9.2.3)}, 
 pdflang={English}}
\begin{document}

\maketitle
\begin{abstract}
This Document contain my notes about Axioms, Definitions and basic theories.
\end{abstract}

\section{Real Numbers}
\label{sec:orgd203bdc}
\subsection{Fields}
\label{sec:org7e4efb2}
In rigorous mathematics real number is a set of numbers defined as a complete, ordered field

\begin{itemize}
\item \textsc{Def}. \emph{Field} is a non-empty set on which two \(\overline{\mbox{binary operation}}\) are
defined \marginpar{refer to Group theory and Set theory TODO}

\item \textsc{Def}. \emph{Binary Operation} in field \(\mathbb{F}\) is a function that "take"
an ordered pair of element and "return" an element in \(\mathbb{F}\), and it said to be
the operation on the set whose both domain and codomain in the same set.
\end{itemize}
\[ \forall a,b \in \mathbb{F} (\exists c \in \mathbb{F}) : (c = a \circ b) \]
\end{document}